/* Includes ------------------------------------------------------------------*/
#include "Conditioner_operation.h"
#include "main_ini.h"


//*****************************************************************************
//Обработка ошибок (аварий)
//*****************************************************************************
void handlERROR (void)
{
	//сброс USART-ов
	if(countReqUSART1>6){
		//перезапуск USART1
		USART1->CR1 &= (uint32_t)~((uint32_t)USART_CR1_UE);
		USART1->CR1 |= USART_CR1_UE;
		USART1->ICR |= USART_ICR_ORECF;
		USART1->ICR |= USART_ICR_FECF;
		USART_DeInit(USART1);
		SetupUSART1();													//инициализация USART для ВНУТРЕННЕГО
		countReqUSART1 = 0;
	}
	if(countReqUSART2>6){
		//перезапуск USART2
		USART2->CR1 &= (uint32_t)~((uint32_t)USART_CR1_UE);
		USART2->CR1 |= USART_CR1_UE;
		USART2->ICR |= USART_ICR_ORECF;
		USART2->ICR |= USART_ICR_FECF;
		USART_DeInit(USART2);
		SetupUSART2(); 													//инициализация USART для ВНЕШНЕГО
		countReqUSART2 = 0;
	}
		
	
	//отслеживание AC220
	if (ac_220){
		R_STATES |= (1<<0);
		R_ALARM &=~ (1<<6);
	}
	else{
		R_STATES &=~(1<<0);
		R_ALARM |=(1<<6);
	}
/*
	//отслеживание DC48
	if (dc_48 >= 2){
		R_ALARM &=~ (1<<7);
	}
	else{
		R_ALARM |= (1<<7);
	}
	*/
	//*******************************************************************************************************	
	//если t внутр. >= t(a2) аварийно-высокой 
	//и нет ошибок датчика
	//и не минусовая температура
	if(((R_T3_INTERNAL&0x7F) >= (W_TA2&0xFF))	
	&& (!(R_T3_INTERNAL&0x100) && !(R_T3_INTERNAL&0x200))
	&& !(R_T3_INTERNAL&0x80)){
		R_ALARM |= (1<<0);									//есть авария - высокая t внутренняя
	}
	//иначе если есть авария высокая t внутренняя
	//и если t внутр. <= (t(a2) - DIF_ALARM_HI)
	//или есть ошибка датчика
	else if((ALARM_HI_INT_TEMP
	&& ((R_T3_INTERNAL&0x7F) <= ((W_TA2&0xFF) - DEF_DIF_ALARM_HI)))
	|| ((R_T3_INTERNAL&0x100) || (R_T3_INTERNAL&0x200))){
		R_ALARM &=~(1<<0);									//нет аварии
	}
	
	//*******************************************************************************************************	
	//если t внутр. <= t(h2) аварийно-низкой 
	//и нет ошибок датчика
	//или минусовая температура
	if((((R_T3_INTERNAL&0x7F) <= W_TH2)		
	&& (!(R_T3_INTERNAL&0x100) && !(R_T3_INTERNAL&0x200)))
	|| (R_T3_INTERNAL&0x80)){
		R_ALARM |= (1<<1);									//есть авария - низкая t внутренняя
	}
	//иначе если есть авария - низкая t внутренняя
	//и если t внутр. >= (t(h2) + DIF_ALARM_LO)
	//или есть ошибки датчика
	else if((ALARM_LO_INT_TEMP
	&& ((R_T3_INTERNAL&0x7F) >= ((W_TH2&0xFF) + DEF_DIF_ALARM_LO)))
	|| ((R_T3_INTERNAL&0x100) && (R_T3_INTERNAL&0x200))){
		R_ALARM &=~(1<<1);									//нет аварии
	}
	
	//*******************************************************************************************************
	//если t на сливе конд. >= заданной авар. t хладагента 
	//и нет ошибок датчика
	if(((R_T7_COND_DRAIN&0x7F) >= (W_T7_ALARM&0xFF))
	&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
		R_ALARM |= (1<<2);									//есть авария - высокое давление
	}
	//иначе если есть авария - высокое давление
	//и если t на сливе конд. <= заданной авар. t хладагента - Δt
	//или есть ошибки датчика
	else if((ALARM_HI_PRESS
	&& (R_T7_COND_DRAIN&0x7F) <= ((W_T7_ALARM&0xFF) - (W_DT7_ALARM&0xFF)))
	|| ((R_T7_COND_DRAIN&0x100) && (R_T7_COND_DRAIN&0x200))){
		R_ALARM &=~(1<<2);									//нет аварии
	}
	//*******************************************************************************************************	
	//если пришло время на событие аварии неисправности кондиционера
	if(time_alarm_freez >= DEF_DELAY_ALARM_COND){
		R_ALARM |= (1<<3);									//есть авария - неисправность кондиционера
	}
	else{
		R_ALARM &=~(1<<3);									//нет аварии
	}
/*	
	//если t6 на всасывающей трубе компрессора <= -2
	//и нет ошибок датчика
	if((((R_T6_SUCK_PIPE&0x7F) >= 2) && (R_T6_SUCK_PIPE&0x80))
	&& (!(R_T6_SUCK_PIPE&0x100) && !(R_T6_SUCK_PIPE&0x200))){
		R_ALARM |= (1<<3);									//есть авария - неисправность кондиционера (испарителя)
	}
	//иначе если есть авария - неисправность кондиционера
	//и если t6 на всасывающей трубе компрессора >= +7
	//или есть ошибка датчика
	else if((ALARM_AIRCOOL_FAULTY
	&& ((R_T6_SUCK_PIPE&0x7F) >= 7) && !(R_T6_SUCK_PIPE&0x80))
	|| ((R_T6_SUCK_PIPE&0x100) && (R_T6_SUCK_PIPE&0x200))){
		R_ALARM &=~(1<<3);									//нет аварии
	}
*/
	//*******************************************************************************************************	
	//если t картера. >= DEF_ALARM_TEMP_COMPRES
	//и нет ошибок датчика
	if(((R_T8_CARTER&0x7F) >= DEF_ALARM_TEMP_COMPRES)
	&& (!(R_T8_CARTER&0x100) && !(R_T8_CARTER&0x200))){
		R_ALARM |= (1<<4);									//есть авария - неисправность компрессора
	}
	//иначе если есть авария - неисправность компрессора
	//и если t картера. <= (авар. t компрес.) - (диф. авар. t компрес.)
	//или есть ошибка датчика
	else if((ALARM_COMPRES_FAULTY
	&& ((R_T8_CARTER&0x7F) <= (DEF_ALARM_TEMP_COMPRES - DEF_DIF_ALARM_TEMP_COMPRES)))
	|| ((R_T8_CARTER&0x100) && (R_T8_CARTER&0x200))){
		R_ALARM &=~(1<<4);									//нет аварии
	}
	
	//*******************************************************************************************************	
	//если пришло время на событие аварии неисправности фрикулинга
	/*
	if(time_freeCool >= DEF_DELAY_ALARM_FCOOL){
		R_ALARM |= (1<<5);									//есть авария - неисправность фрикулинга
	}
	else{
		R_ALARM &=~(1<<5);									//нет аварии
	}
	*/
}



//*****************************************************************************
//Управление компрессором
//*****************************************************************************
void compressControl(void)
{
	if(ALARM_COMPRES_FAULTY){										//если авария компрессора (t > DEF_ALARM_TEMP_COMPRES)
		GPIOB->BRR = PIN_RELAY_COMPRESS;					//выключаем компрессор
		R_STATES &=~(1<<1);												//состояние компрессора = 0
		statCompress._startON = 0;								//включение компрессора запрещено
	}
	else{ 
		//если температура картера >= +5 
		//и t6 на всас. трубе не ниже 0
		//и нет аварии по высокому давлению
		//и есть 220В
		//и нет ошибок датчиков температуры
		if((!(R_T8_CARTER&0x80) && ((R_T8_CARTER&0x7F) >= 5))
		&& (!(R_T6_SUCK_PIPE&0x80))
		&& (!ALARM_HI_PRESS)
		&& (!ALARM_220V)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))
		&& (!(R_T8_CARTER&0x100) && !(R_T8_CARTER&0x200))
		&& (!(R_T3_INTERNAL&0x100) && !(R_T3_INTERNAL&0x200))){
			statCompress._startON = 1;							//включение компрессора разрешено
		}
		else{
			statCompress._startON = 0;							//включение компрессора запрещено
			statCompress.statN = 0;									//сброс в первоначальное состояние
			statCompress.time_compres = 0;					//сбрасываем таймер
		}
	}
	//если t внутр. = 85
//	if((R_T3_INTERNAL&0x7F)==85){
//		statCompress._startON = 0;								//включение компрессора запрещено
//		statCompress.statN = 0;										//сброс в первоначальное состояние
//		statCompress.time_compres = 0;						//сбрасываем таймер
//	}
	//если включение разрешено
	if(statCompress._startON)
	{
		switch(statCompress.statN)
		{
			case 0:	//первоначальное включение компрессора
				//если прошло 3 минуты и t внутр. >= t заданной 
				//или если t внутр. >= t(a1) срочного включения
				//и если t внутр. не минусовая
				if((((statCompress.time_compres>=180) && ((R_T3_INTERNAL&0x7F) >= (W_T_INT&0xFF)))
				|| ((R_T3_INTERNAL&0x7F) >= (W_TA1&0xFF)))
				&& !(R_T3_INTERNAL&0x80)){
					GPIOB->BSRR = PIN_RELAY_COMPRESS;				//включаем компрессор
					R_STATES |= (1<<1);											//состояние компрессора = 1
					statCompress.time_compres = 0;					//сбрасываем таймер
					statCompress.statN = 1;									//выходим из первоначального состояния
					statCond = 1;														//состояние вент. конденсатора
				}
				else{
					R_STATES &=~(1<<1);											//состояние компрессора = 0
					GPIOB->BRR = PIN_RELAY_COMPRESS;				//компрессор выключен
				}
				break;
			case 1:	//выключение компрессора
				//если прошло 3 минуты и t внутр. <= t заданной минус Δt
				//или если t внутр. <= t(h1) срочного выключения 
				//или если t внутр. минусовая
				if(((statCompress.time_compres>=180) && (R_T3_INTERNAL <= (W_T_INT-W_DT_INT))) 
				|| (R_T3_INTERNAL <= W_TH1)
				|| (R_T3_INTERNAL&0x80)){
					GPIOB->BRR = PIN_RELAY_COMPRESS;				//выключаем компрессор
					R_STATES &=~(1<<1);											//состояние компрессора = 0
					//statCompress.time_compres = 0;					//сбрасываем таймер
					statCompress.statN = 2;									//переход к состоянию 2
				}
				else{
					R_STATES |= (1<<1);											//состояние компрессора = 1
					GPIOB->BSRR = PIN_RELAY_COMPRESS;				//компрессор включен
				}
				break;
			case 2:	//повторное включение компрессора
				//если прошло 7 мин. от последн. вкл. и t внутр. >= t заданной 
			  //или если t внутр. >= t(a1) срочного включения
				//и если t внутр. не минусовая
				if((((statCompress.time_compres>=420) && (R_T3_INTERNAL >= W_T_INT))
				|| ((R_T3_INTERNAL&0x7F) >= (W_TA1&0xFF)))
				&& !(R_T3_INTERNAL&0x80)){
					GPIOB->BSRR = PIN_RELAY_COMPRESS;				//включаем компрессор
					R_STATES |= (1<<1);											//состояние компрессора = 1
					statCompress.time_compres = 0;					//сбрасываем таймер
					statCompress.statN = 1;									//переход к состоянию 1
				}
				else{
					R_STATES &=~(1<<1);											//состояние компрессора = 0
					GPIOB->BRR = PIN_RELAY_COMPRESS;				//компрессор выключен
				}
				break;
			default:
				break;
		}		
	}
	else{
		GPIOB->BRR = PIN_RELAY_COMPRESS;							//выключаем компрессор
		R_STATES &=~(1<<1);														//состояние компрессора = 0
	}
}



//*****************************************************************************
//Управление тэнами
//*****************************************************************************
void tenControl(void) 
{
	//если t втутр. < t задан.-(Δt+1)
	//или t внутр. минусовая
	//и выключен компрессор
	//и нет ошибок датчика температуры
	/*
	if((((R_T3_INTERNAL&0x7F) < ((W_T_INT&0xFF)-((W_DT_INT&0xFF)+1)))
	||(R_T3_INTERNAL&0x80))
	&& (!(R_STATES&0x02))
	&& (!(R_T3_INTERNAL&0x100) && !(R_T3_INTERNAL&0x200))){
		GPIOB->BSRR = PIN_RELAY_HEAT_BOX;							//включаем тэн подргрева шкафа
		R_STATES |= (1<<4);								//состояние тэна подогрева шкафа = 1
	}
	//иначе если тэн подргрева шкафа включен
	//и t внутр. >= t задан.-Δt
	else if((R_STATES&0x10)
	&& ((R_T3_INTERNAL&0x7F) >= ((W_T_INT&0xFF)-(W_DT_INT&0xFF)))){
		GPIOB->BRR = PIN_RELAY_HEAT_BOX;							//выключаем тэн подргрева шкафа
		R_STATES &=~ (1<<4);							//состояние тэна подогрева шкафа = 0
	}
	//если ошибка датчика
	else if((R_T3_INTERNAL&0x100) || (R_T3_INTERNAL&0x200)){
		GPIOB->BRR = PIN_RELAY_HEAT_BOX;							//выключаем тэн подргрева шкафа
		R_STATES &=~ (1<<4);							//состояние тэна подогрева шкафа = 0
	}
	*/
	//*******************************************************************************************************	
	//если t окруж. <= 2 градусов 
	//и нет ошибок датчика температуры
	if(((R_T1_AMBIENT&0x7F) <= 2 || (R_T1_AMBIENT&0x80)) 
	&& (!(R_T1_AMBIENT&0x100) && !(R_T1_AMBIENT&0x200))){
		GPIOB->BSRR = PIN_RELAY_HEAT_DRAIN;						//включаем тэн дренажа
		R_STATES |= (1<<3);								//состояние тэна дренажа = 1
	}
	//иначе если тэн дренажа включен
	//и t окруж. > 2
	else if((R_STATES&0x08)
	&& ((R_T1_AMBIENT&0x7F)>3)){
		GPIOB->BRR = PIN_RELAY_HEAT_DRAIN;						//выключаем тэн дренажа
		R_STATES &=~ (1<<3);							//состояние тэна дренажа = 0
	}
	//если ошибка датчика
	else if((R_T1_AMBIENT&0x100) || (R_T1_AMBIENT&0x200)){
		GPIOB->BRR = PIN_RELAY_HEAT_DRAIN;						//выключаем тэн дренаж
		R_STATES &=~ (1<<3);							//состояние тэна дренажа = 0
	}
	//*******************************************************************************************************	
	//если t картера <= +8 градусов 
	//и нет ошибок датчика температуры
	if(((R_T8_CARTER&0x7F) <= 8 || (R_T8_CARTER&0x80)) 
	&& (!(R_T8_CARTER&0x100) && !(R_T8_CARTER&0x200))){
		GPIOB->BSRR = PIN_RELAY_HEAT_CARTER;					//включаем тэн подогрева картера
		R_STATES |= (1<<2);							//состояние тэна подогрева картера = 1
	}
	//иначе если тэн картера включен
	//и t картера. > 9
	else if((R_STATES&0x04)
	&& ((R_T8_CARTER&0x7F)>9)){
		GPIOB->BRR = PIN_RELAY_HEAT_CARTER;						//выключаем тэн подогрева картера
		R_STATES &=~ (1<<2);							//состояние тэна подогрева картера = 0
	}
	//если ошибка датчика
	else if((R_T8_CARTER&0x100) || (R_T8_CARTER&0x200)){
		GPIOB->BRR = PIN_RELAY_HEAT_CARTER;						//выключаем тэн подргрева шкафа
		R_STATES &=~ (1<<2);							//состояние тэна подогрева шкафа = 0
	}
}

//*****************************************************************************
//Управление вентилятором конденсатора
//*****************************************************************************
void fan_condControl(void)
{
	//Если включился компрессор и не прошло время задержки "перехода в рабочий режим"
	//и если t7 не в зоне ++
	if((STATE_COMPRESSOR) && (time_fanCond < DEF_DELAY_WORK_FAN_COND)
	&& ((R_T7_COND_DRAIN&0x7F) < W_TZPPK)){
		//если t окр. не минусовая и меньше +15
		//и нет ошибок датчика
		if(!(R_T1_AMBIENT&0x80)&&((R_T1_AMBIENT&0x7F) < 15)
		&& (!(R_T1_AMBIENT&0x100) && !(R_T1_AMBIENT&0x200))){
			TIM1->CCR1 = (TIM1->ARR/100)*30;							//устанавливаем скорость вращения на 30%
		}
		//если t окр. не минусовая и больше или равна +15  и меньше +20
		//и нет ошибок датчика
		else if((!(R_T1_AMBIENT&0x80)&&((R_T1_AMBIENT&0x7F) >= 15)&&((R_T1_AMBIENT&0x7F) < 20))
		&& (!(R_T1_AMBIENT&0x100) && !(R_T1_AMBIENT&0x200))){
			TIM1->CCR1 = (TIM1->ARR/100)*50;							//устанавливаем скорость вращения на 50%
		}
		//если t окр. не минусовая и больше или равна +20
		//и нет ошибок датчика
		else if(!(R_T1_AMBIENT&0x80)&&((R_T1_AMBIENT&0x7F) >= 20)
		&& (!(R_T1_AMBIENT&0x100) && !(R_T1_AMBIENT&0x200))){
			TIM1->CCR1 = (TIM1->ARR/100)*100;							//устанавливаем скорость вращения на 100%
		}
	}
 	else{
		//если t7 >= t зоны "++" конденсатора
		//и t7 не минусовая
		//и нет ошибок датчика температуры
		if(((R_T7_COND_DRAIN&0x7F) >= (W_TZPPK&0xFF))
		&& !(R_T7_COND_DRAIN&0x80)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
			incZP = (TIM1->ARR - MIN_SPEED_CH1) / W_TIMEZPPK;
			decZM = 0;
		}
		
		//если t7 >= t зоны "+" конденсатора
		//и t7 не минусовая
		//и нет ошибок датчика температуры
		else if(((R_T7_COND_DRAIN&0x7F) >= (W_TZPK&0xFF))
		&& !(R_T7_COND_DRAIN&0x80)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
			if(TIM1->CCR1 == 0)TIM1->CCR1 = MIN_SPEED_CH1;
			incZP = (TIM1->ARR - MIN_SPEED_CH1) / W_TIMEZPK;
			decZM = 0;
		}
		
		//если "NZ"
		//и t7 не минусовая
		//и нет ошибок датчика температуры
		else if((((R_T7_COND_DRAIN&0x7F) < (W_TZPK&0xFF))
		&& ((R_T7_COND_DRAIN&0x7F) >= (W_TZMK&0xFF)))
		&& !(R_T7_COND_DRAIN&0x80)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
			incZP = 0;
			decZM = 0;
		}
		
		//если t7 < t зоны "-" конденсатора
		//и t7 > t зоны "--"
		//и t7 не минусовая
		//и нет ошибок датчика температуры
		else if((((R_T7_COND_DRAIN&0x7F) < (W_TZMK&0xFF))
		&& (R_T7_COND_DRAIN&0x7F) > (W_TZMMK&0xFF))
		&& (TIM1->CCR1 != 0)
		&& !(R_T7_COND_DRAIN&0x80)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
			incZP = 0;
			decZM = (TIM1->ARR - MIN_SPEED_CH1) / W_TIMEZMK;
		}
		
		//если t7 <= t зоны "--" конденсатора
		//и t7 не минусовая
		//и нет ошибок датчика температуры
		else if(((R_T7_COND_DRAIN&0x7F) <= (W_TZMMK&0xFF))
		&& !(R_T7_COND_DRAIN&0x80)
		&& (!(R_T7_COND_DRAIN&0x100) && !(R_T7_COND_DRAIN&0x200))){
			incZP = 0;
			decZM = 0;
			TIM1->CCR1 = 0; 														//останавливаем вент. конденсатора
		}
	}
	
	//Если ошибка датчика T7
	if((R_T7_COND_DRAIN&0x100) || (R_T7_COND_DRAIN&0x200)){
			TIM1->CCR1 = TIM1->ARR; 										//скорость вращения вент. конденсатора на max.
		}
	
	//если компрессор выключен
	if((R_STATES&0x02)==0){
		time_fanCond=0;																//сбрасываем таймер вентилятора конденсатора
	}
	
	//если скорость вент. конд. не равна 0
	if(TIM1->CCR1 != 0){
		R_STATES |= (1<<7);														//состояние вент. конденсатора = 1
	}
	else{
		R_STATES &=~ (1<<7);													//состояние вент. конденсатора = 0
	}
}


//*****************************************************************************
//Управление вентилятором испарителя
//*****************************************************************************
void fan_freezerControl(void)
{
	TIM3->CCR4 = (uint16_t)(((uint32_t) 100*(TIM3->ARR))/100);			//скорость вент. на 100%
/*	
	//если не прошло 10 секунд
	if(time_freez < 10){
		TIM3->CCR4 = (uint16_t)(((uint32_t) 100*(TIM3->ARR))/100);			//скорость вент. на 100%
	}
	else{
		TIM3->CCR4 = (uint16_t)(((uint32_t) 80*(TIM3->ARR))/100);				//скорость вент. на 80%
	}
	
	//Если температура на всасывающей трубе компрессора <= 2
	//или минусовая
	//и если t окр. не минусовая и больше или равна +10
	if((((R_T6_SUCK_PIPE&0x7F) <= 2)
		|| (R_T6_SUCK_PIPE&0x80))
		&& (!(R_T1_AMBIENT&0x80)&&((R_T1_AMBIENT&0x7F) >= 10))){
			TIM3->CCR4 = (uint16_t)(((uint32_t) 100*(TIM3->ARR))/100);			//скорость вент. на 100%
			time_freez = 0;
	}
	*/
	//если скорость вент. испарит. не равна 0
	if(TIM3->CCR4 != 0){ 
		R_STATES |= (1<<6);														//состояние вент. испарителя = 1
	}
	else{
		R_STATES &=~ (1<<6);													//состояние вент. испарителя = 0
	}

/*
	//если прошло 10 секунд
	if(time_freez_2 > 10){
		TIM3->CCR4 = (uint16_t)(((uint32_t) 75*(TIM3->ARR))/100);				//скорость вент. на 75%
		time_freez_2 = 11;
	}
	else{
		TIM3->CCR4 = (uint16_t)(((uint32_t) 100*(TIM3->ARR))/100);			//скорость вент. на 100%
	}
	
	//Если температура на всасывающей трубе компрессора <= 2
	//или минусовая
	//и если t окр. не минусовая и больше или равна +15
	if((((R_T6_SUCK_PIPE&0x7F) <= 2)
		|| (R_T6_SUCK_PIPE&0x80))
		&& (!(R_T1_AMBIENT&0x80)&&((R_T1_AMBIENT&0x7F) >= 15))){
			TIM3->CCR4 = (uint16_t)(((uint32_t) 100*(TIM3->ARR))/100);			//скорость вент. на 100%
			time_freez_2 = 0;
	}
	
	//если скорость вент. испарит. не равна 0
	if(TIM3->CCR4 != 0){ 
		R_STATES |= (1<<6);														//состояние вент. испарителя = 1
	}
	else{
		R_STATES &=~ (1<<6);													//состояние вент. испарителя = 0
	}
*/
}


//*****************************************************************************
//Управление вентилятором фрикулинга
//*****************************************************************************
/*void fan_freecoolControl(void)
{
	//если фрикулинг выключен 
	//и t окр. <= t вкл. фрикулинга
	//и t внутр. >= t задан.-Δt
	//и нет ошибок датчиков
	if((((R_T1_AMBIENT&0x7F) <= W_TONF) || (R_T1_AMBIENT&0x80))
	//если t окр. < t внутр. или t окр. минусовая
//	if((((R_T1_AMBIENT&0x7F) <= (R_T3_INTERNAL&0x7F)) || (R_T1_AMBIENT&0x80))
	&& !(R_STATES&0x20)
	&& ((R_T3_INTERNAL&0x7F) >= (W_T_INT - W_DT_INT))
	&& (!(R_T1_AMBIENT&0x100) && !(R_T1_AMBIENT&0x200))
	&& (!(R_T3_INTERNAL&0x100) && !(R_T3_INTERNAL&0x200))){
		GPIO_WriteBit(PIN_FAN_FCOOL, Bit_SET);							//включаем вентелятор фрикул.
	}
	//иначе если фрикулинг включён
	//и если t окр. > t вкл. фрикулинга+1
	//или если t внутр. <= t задан.-Δt
	else if(((R_STATES&0x20)
	&& ((R_T1_AMBIENT&0x7F) > W_TONF+1))
	//и если t окр. > t внутр.
//	&& ((R_T1_AMBIENT&0x7F)>(R_T3_INTERNAL&0x7F)))
	|| ((R_T3_INTERNAL&0x7F) <= (W_T_INT - W_DT_INT))){
		GPIO_WriteBit(PIN_FAN_FCOOL, Bit_RESET);						//выкл. вентелятор фрикул.
	}
	
	//Если нет 220В 
	//и t внутр. >= t внешней
	//и t внутр. >= t задан.-Δt
	if(ac_220 == 0
	&& ((R_T3_INTERNAL&0x7F)>=(R_T1_AMBIENT&0x7F))
	&& ((R_T3_INTERNAL&0x7F) >= (W_T_INT - W_DT_INT))){
		GPIO_WriteBit(PIN_FAN_FCOOL, Bit_SET);							//включаем вентелятор фрикул.
	}
	
	//если вент. фрикул. включен
	if(GPIO_ReadOutputDataBit(PIN_FAN_FCOOL)){
		R_STATES |= (1<<5);																	//состояние вент. фрикул. = 1
	}
	else{
		R_STATES &=~ (1<<5);																//состояние вент. фрикул. = 0
	}	
}
*/



